WELCOME_MESSAGE = """
سلام! به صدایار خوش اومدی 🎧✨

من دستیار هوشمند تو برای پردازش سریع فایل‌های صوتی و ویدیویی هستم. دیگه نیازی به تایپ کردن طولانی یا نگرانی بابت ویس‌های چند دقیقه‌ای نیست!

امکاناتی که در اختیار داری:
🎙 تبدیل دقیق ویس به متن
🎬 استخراج صدا از فایل‌های ویدیویی
🗣 تبدیل متن به صوت با صدای طبیعی

👇 برای شروع، کافیه یکی از گزینه‌های منوی زیر رو انتخاب کنی یا فایلت رو مستقیماً برام بفرستی:
"""

VOICE_TO_TEXT = "🎤 تبدیل ویس به متن"
TEXT_TO_SPEECH = "📝 تبدیل متن به صوت"
VIDEO_TO_TEXT = "🎬 تبدیل ویدیو به صوت/متن"
PROFILE = "👤 حساب کاربری"
HELP = "ℹ️ راهنما"
SUPPORT = "👨‍💻 پشتیبانی"
BUY_PREMIUM ="💎 خرید اشتراک ویژه"


BOT_USERNAME = "@sedayarBot"  # اینجا آیدی دقیق رباتت رو بذار

# امضای متنی برای زمانی که ربات یک متن طولانی برمی‌گرداند (مثل تبدیل ویس به متن)
TEXT_WATERMARK = f"\n\n🤖 🎙 پردازش شده توسط ربات صدایار: {BOT_USERNAME}"

# امضای کپشن برای زمانی که ربات فایل صوتی یا ویدیویی می‌فرستد
CAPTION_WATERMARK = f"🎧 ساخته شده با صدایار: {BOT_USERNAME}"

REFRAL_MESSAGE= "🎁 دریافت سهمیه رایگان"